app/views/loans/_form.html.erb

SELECT "users".* FROM "users"
---
  <div class="form-group">
    <% usuario = User.all.map { |user| [user.email, user.id] } %>