app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "321"], ["author", ""], ["isbn", ""], ["created_at", "2020-12-02 22:35:10.230997"], ["updated_at", "2020-12-02 22:35:10.230997"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = ?, "author" = ?, "isbn" = ?, "published_at" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "python para todos"], ["author", "jose"], ["isbn", "124"], ["published_at", "2020-11-11"], ["updated_at", "2020-11-24 17:25:11.542890"], ["id", 2]]
---
  def update
      respond_to do |format|
        if @book.update(book_params)