app/controllers/loans_controller.rb

  def index
    @loans = Loan.all
    @books = Book.all
    @users = User.all
---
SELECT "loans".* FROM "loans"
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

  def new
    @loan = Loan.new
    @users = User.all
    @books = Book.all.select { |book| book.loans? }
---
SELECT "users".* FROM "users"
SELECT "loans".* FROM "loans" WHERE "loans"."book_id" = ?  [["book_id", 1]]
SELECT "books".* FROM "books"

  def edit
    if current_user.authorized?
      @users = User.all
      @books = Book.all.select { |book| book.loans? }
---
SELECT "users".* FROM "users"
SELECT "books".* FROM "books"

  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save
---
INSERT INTO "loans" ("book_id", "user_id", "created_at", "updated_at", "state", "loan_start") VALUES (?, ?, ?, ?, ?, ?)  [["book_id", 2], ["user_id", 1], ["created_at", "2020-12-03 01:20:43.241192"], ["updated_at", "2020-12-03 01:20:43.241192"], ["state", "En Curso"], ["loan_start", "2020-12-10"]]

  def update
    respond_to do |format|
      if @loan.update(loan_params)
---
UPDATE "loans" SET "user_id" = ?, "book_id" = ?, "state" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["user_id", 1], ["book_id", 3], ["state", "Entregado"], ["updated_at", "2020-12-03 02:40:05.895371"], ["id", 5]]

  def destroy
    @loan.destroy
---
DELETE FROM "loans" WHERE "loans"."id" = ?  [["id", 2]]