app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy