app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = ?  [["user_id", 6]]
---
  def index
    @users = User.where.not(admin: true)
    @books = Book.all
    @loans = Loan.all

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save