app/models/book.rb

    def loans?
        self.loans.empty?
---
SELECT 1 AS one FROM "loans" WHERE "loans"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]